Ran Plan for dir: `projects/dev` workspace: `default`

<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.argocd.data.kubernetes_secret.argocd_initial_password will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "kubernetes_secret" "argocd_initial_password" {
      + data      = (sensitive value)
      + id        = (known after apply)
      + immutable = (known after apply)
      + type      = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "argocd-initial-admin-secret"
          + namespace        = "argocd"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.cloudflare.cloudflare_dns_record.istio-gateway will be updated in-place
~ resource "cloudflare_dns_record" "istio-gateway" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ content             = "34.47.92.167" -> (known after apply)
      ~ created_on          = "2025-01-28T12:03:24Z" -> (known after apply)
      + data                = (known after apply)
        id                  = "5b3805bf479bd12a29aad2877a6cfdfa"
      ~ meta                = jsonencode(
            {
              - auto_added             = false
              - managed_by_apps        = false
              - managed_by_argo_tunnel = false
            }
        ) -> (known after apply)
      ~ modified_on         = "2025-01-28T12:03:24Z" -> (known after apply)
        name                = "*.goboolean.io"
      ~ proxiable           = true -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.gce.google_compute_instance.default will be updated in-place
~ resource "google_compute_instance" "default" {
        id                        = "projects/goboolean-448812/zones/asia-northeast3-a/instances/atlantis"
      ~ metadata                  = {
          - "ssh-keys" = <<-EOT
                jipark7937:ecdsa-sha2-nistp256 AAAAE2VjZHNhLXNoYTItbmlzdHAyNTYAAAAIbmlzdHAyNTYAAABBBEJWj5cC0ltEFcYLoCJsg7gfHvixISHaMaXhmatFqtbzlzhQp2I5v/GLLCRHZYo3jxMsO7b7SrcH0TaIRBaoYfw= google-ssh {"userName":"jipark7937@gmail.com","expireOn":"2025-02-03T18:02:49+0000"}
                jipark7937:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAGvJS1fwrvPhILRksN/IkNYaq6NdZzEqFWD7O+0W8J9rR6Q3cNQ7wmlUgGogjAQJdfu4GbC6YUUKf2aVuJsyflAd/puNgIBiPhdRBTMqM2iXfKksg95PCXHMuRIXMQ6+HHgBPFgDDBhWLYVoAJdstWnqEU+v4GxARZiXpFVIX2JKWpOuBUIOONF5PZybP1FMrZmua/a5QlGDIxuTJySmwAWM6ULKk6hxxKae4Qg05RKkrg82WCIXc4/BTXaYmrNyti98i/S7Go2G5apgaeO87srmzZMoRrI+HzR3DtxGmz7JOKirIvKm48lMFJXkjwl798lfBNZTVr8+lAX2e3xXFBk= google-ssh {"userName":"jipark7937@gmail.com","expireOn":"2025-02-03T18:02:55+0000"}
            EOT -> null
        }
        name                      = "atlantis"
        tags                      = [
            "atlantis-server",
        ]
        # (20 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.istio.data.kubernetes_service.istio_ingressgateway will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "kubernetes_service" "istio_ingressgateway" {
      + id     = (known after apply)
      + spec   = (known after apply)
      + status = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "istio-ingressgateway"
          + namespace        = "istio-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.namespace.kubernetes_namespace.istio-system will be updated in-place
~ resource "kubernetes_namespace" "istio-system" {
        id                               = "istio-system"
      + wait_for_default_service_account = false

      ~ metadata {
          ~ labels           = {
              - "name" = "istio-system" -> null
            }
            name             = "istio-system"
            # (5 unchanged attributes hidden)
        }
    }

Plan: 0 to add, 3 to change, 0 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d projects/dev`
* :put_litter_in_its_place: To **delete** this plan click [here](http://34.64.35.124/lock?id=goboolean%252Finfrastructure%252Fprojects%252Fdev%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d projects/dev`
</details>
Plan: 0 to add, 3 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
